content/work/cheesecake.md
---
title: "Cheesecake"
author: ["Carl Colglazier"]
aliases: ["/projects/frc-elo/"]
draft: false
types: "Software"
tools: ["Python", "Flask", "React.js"]
---

Cheesecake is an evidence-based scouting and statistics approach to
the _FIRST_ Robotics Competition. It has two main goals:

1.  To use existing data on the results of _FIRST_ competitions to
    create measurably accurate prediction metrics.
2.  To facilitate a mixed-methods (quantitative plus qualitative)
    approach to FRC scouting specific to each game.

Cheesecake takes an empirical, evidence-based approach to how it
handles FRC data.


## Motivation {#motivation}

Scouting is a large commitment for a team. At most competitions we
attend, we usually allocate a significant amount of team resources to
ensure we have as much data as possible on each robot at the
competition. This information typically goes into a binder and is used
by our scouting team to determine the best robots to pick during the
alliance selections and the optimal strategies to play against
individual robots.

The goal of Cheesecake is to ensure that scouting information is
transformed into useful metrics. It draws inspiration (and some
models) from other types of sports analytics, statistics, and previous
related systems.
